// exercisesData.js
const exercisesData = [
    {
      id: 1,
      name: "푸쉬업",
      summary:"푸쉬업은 상체와 코어 근육을 강화하는 운동입니다.",
      description: [
        "바닥에 엎드린 자세에서 손을 어깨너비보다 약간 넓게 두고, 팔을 펴서 몸을 바닥에서 들어올립니다.",
        "팔꿈치를 몸 쪽으로 유지하면서 천천히 몸을 낮춰 가슴이 바닥과 거의 닿을 때까지 내립니다.",
        "몸 전체를 일직선으로 유지하면서 다시 시작 자세로 돌아갑니다."
      ],
      videoUrl: "https://videos.pexels.com/video-files/4158864/4158864-hd_1080_1920_24fps.mp4",
    },
    {
      id: 2,
      name: "런지",
      summary:"런지는 하체 근력을 강화하고 균형감각을 향상시키는 운동입니다.",
      description: ["양 발을 어깨너비로 벌린 후, 한 발을 크게 앞으로 내딛습니다.",
                    "앞으로 내딛은 다리의 무릎이 발끝을 넘지 않도록 주의하면서, 상체를 곧게 유지한 채 뒷다리의 무릎이 바닥에 거의 닿을 때까지 몸을 천천히 내립니다.",
                    "다시 시작 자세로 돌아가서 반대쪽 다리로 반복합니다."],
      videoUrl: "https://videos.pexels.com/video-files/5025832/5025832-hd_1080_1920_25fps.mp4",
    },
    {
        id: 3,
        name: "사이드 런지",
        summary:"사이드 런지는 특히 내전근과 허벅지의 옆부분을 강화하는데 효과적인 운동입니다.",
        description: ["양 발을 어깨너비로 벌린 자세에서 한쪽 다리를 크게 옆으로 내딛습니다.",
                    "옆으로 내딛은 다리 쪽으로 체중을 이동시키면서, 내딛은 다리의 무릎을 구부리고 반대쪽 다리는 펴서 옆구리의 스트레칭을 느낍니다.",
                    "처음 자세로 돌아가서 반대쪽 다리로 같은 동작을 반복합니다."],
        videoUrl: "https://videos.pexels.com/video-files/8893506/8893506-uhd_2160_4096_24fps.mp4",
      },
      {
        id: 4,
        name: "스쿼트",
        summary:"스쿼트는 하체와 코어 근육을 강화하는 기본적이면서도 효율적인 운동입니다.",
        description: ["양 발을 어깨너비로 벌리고 서서, 엉덩이를 뒤로 빼면서 앉듯이 몸을 낮춥니다.",
                    "무릎이 발끝을 넘지 않도록 주의하면서, 상체는 가능한 곧게 유지합니다.",
                    "다리의 힘을 이용해 천천히 시작 자세로 돌아갑니다"],
        videoUrl: "https://videos.pexels.com/video-files/6525519/6525519-hd_1080_1920_30fps.mp4",
      },
  ];
  
  export default exercisesData;
  